9/data/attachments/ea9c14b5c685b45.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_b5bc6a06-fa07-48ad-a2ac-3213c9328c43</nif:username>
            <nif:friendToBeAdded>Nicholas_team_Friend_22109_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>